haoside/matter-panel/esp32-firmware/sdkconfig.defaults
# Matter + ESP32-H2 Thread 默认配置 (XIAO ESP32-H2, 4MB Flash)

# 目标芯片 — Thread 原生支持
CONFIG_IDF_TARGET="esp32h2"

# Flash 配置 (4MB)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# 分区表
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# 启用 Matter
CONFIG_ENABLE_MATTER=y

# Thread / 802.15.4 (H2 原生)
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_RADIO_NATIVE=y

# BLE (用于 Matter 配网)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# 内存优化
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=2048

# 日志级别
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# OTA
CONFIG_ESP_MATTER_ENABLE_OTA_REQUESTOR=y

# H2 特有优化
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_96=y
CONFIG_ESP_INT_WDT_TIMEOUT_MS=1000

# mbedtls HKDF (Matter 依赖)
CONFIG_MBEDTLS_HKDF_C=y

# Thread 网络参数
CONFIG_OPENTHREAD_NETWORK_NAME="matter-panel"
CONFIG_OPENTHREAD_CHANNEL=15
CONFIG_OPENTHREAD_PANID=0x1234
